In [1]:
import pandas as pd
import numpy as np

# 1. Ordenar o DataFrame com base noutra lista

In [2]:
df = pd.DataFrame([["A", 1],
                   ["B", 2],
                   ["C", 3],
                   ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [3]:
sort_list = ["C", "A", "D", "B"]

In [4]:
## inicie o seu código abaixo
#new_df = ...
## termine aqui o seu código
s = pd.Series(range(len(sort_list)), index=sort_list)
new_df = df.sort_values("col_A", key = lambda x: x.map(s))
#new_df = df.set_index("col_A").loc[sort_list].reset_index()
#ou
#df["col1"] = pd.Categorical(df["col_A"], categories=sort_list, ordered=True)
#new_df = df.sort_values("col_A").reset_index(drop=True)

In [6]:
new_df

  col_A  col_B
2     C      3
0     A      1
3     D      4
1     B      2

# 2. Inserir uma coluna numa posição específica num DataFrame

In [7]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [8]:
new_column = ["P", "Q", "R", "S"]

insert_position = 1 ## entre col_A e col_B

In [9]:
## inicie o seu código abaixo
#new_df = ...
## termine aqui o seu código
df.insert(insert_position, "col_C", new_column)
new_df = df

In [10]:
new_df

  col_A col_C  col_B
0     A     P      1
1     B     Q      2
2     C     R      3
3     D     S      4

# 3. Selecionar colunas com base no tipo de dados da coluna

In [11]:
df = pd.DataFrame([["A", 1, True], ["B", 2, False],
                   ["C", 3, False], ["D", 4, True]], 
                  columns=["col_A", "col_B", "col_C"])

df

  col_A  col_B  col_C
0     A      1   True
1     B      2  False
2     C      3  False
3     D      4   True

In [12]:
dt_type = "bool"

In [13]:
## inicie o seu código abaixo
new_df = df.select_dtypes(include=[dt_type])
## termine aqui o seu código

In [14]:
new_df

   col_C
0   True
1  False
2  False
3   True

In [15]:
df['col_C']

0     True
1    False
2    False
3     True
Name: col_C, dtype: bool

# 4. Contar o número de células Non-NaN para cada coluna

In [45]:
df = pd.DataFrame([["A", np.nan], [np.nan, 2],
                   ["C", np.nan], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A    NaN
1   NaN    2.0
2     C    NaN
3     D    4.0

In [ ]:
## inicie o seu código abaixo
#new_df = df.count()
## termine aqui o seu código

In [47]:
#print (len(df) * 2 - 3 -2)
#print ( len(df) *2 - sum(df.count()))
print ( len(df) * len(df.columns) - sum(df.count()))

df.isna().sum().sum() # .sum()
#new_df

#count = df.isna().sum()

3

np.int64(3)

# 5. Dividir o DataFrame em partes iguais

In [64]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [65]:
parts = 2

In [67]:
## inicie o seu código abaixo
new_df1, new_df2 = np.array_split(df, parts)
## termine aqui o seu código

d:\PastaUFCDs\UFCD1080803032025\Pandas - Ficha 1\venv\Lib\site-packages\numpy\_core\fromnumeric.py:57: FutureWarning: 'DataFrame.swapaxes' is deprecated and will be removed in a future version. Please use 'DataFrame.transpose' instead.
  return bound(*args, **kwds)

In [68]:
new_df1

  col_A  col_B
0     A      1
1     B      2

In [69]:
new_df2

  col_A  col_B
2     C      3
3     D      4

# 6. Inverter o DataFrame por linha ou coluna

In [101]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [102]:
## inicie o seu código abaixo
col_reverse = df.loc[:, ::-1] # - inversão da coluna
#col_reverse = df[['col_B','col_A']] - inversão da coluna
#col_reverse = df['col_B'] 
#col_reverse = df['col_B'].astype(str) + df['col_A'].astype(str) -  concatenação
## termine aqui o seu código

In [106]:
col_reverse

   col_B col_A
0      1     A
1      2     B
2      3     C
3      4     D

In [104]:
## inicie o seu código abaixo
#row_reverse = df.iloc[::-1] # inversão da linha DCBA - negativo
#row_reverse = df.loc[::-1]
row_reverse =df.loc[::-1,:]
#row_reverse = df.loc[:,:] # bidimensional a lista fica ABCD - positivo
## termine aqui o seu código

In [105]:
row_reverse

  col_A  col_B
3     D      4
2     C      3
1     B      2
0     A      1

# 7. Reorganizar as colunas de um DataFrame

In [112]:
df = pd.DataFrame([["A", 1,1], ["B", 2,2],
                   ["C", 3,3], ["D", 4,4]], 
                  columns=["col_A", "col_B", 'col_C'])

df

  col_A  col_B  col_C
0     A      1      1
1     B      2      2
2     C      3      3
3     D      4      4

In [113]:
## inicie o seu código abaixo
#new_df = df[["col_B", "col_A"]]
rearrange_order = [2, 0, 1]
## termine aqui o seu código

In [116]:
new_df = df.iloc[:, rearrange_order]
new_df

   col_C col_A  col_B
0      1     A      1
1      2     B      2
2      3     C      3
3      4     D      4

# 8. Obter linhas alternativas de um DataFrame

In [117]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [120]:
## inicie o seu código abaixo
#new_df = df.iloc[::2]
new_df = df.loc[::2]
## termine aqui o seu código

In [119]:
new_df

  col_A  col_B
0     A      1
2     C      3

# 9. Inserir uma linha numa posição arbitrária

In [148]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [149]:
insert_pos = 1
insert_row = ["P", 5]

In [152]:
## inicie o seu código abaixo
#df.loc[insert_pos] = insert_row
df.loc[insert_pos-0.1] = insert_row 


# new_row = pd.DataFrame([insert_row], columns=["col_A", "col_B"])
# new_df = pd.concat([df.iloc[:insert_pos], new_row, df.iloc[insert_pos:]]).reset_index(drop=True)
## termine aqui o seu código

In [ ]:
df = df.sort_index()
df = df.reset_index( drop = True)
df

#  Exercício extra:
Se tivermos o dataframe abaixo como implementar uma função para concatenar as células de texto consigo próprias, e adicionar 1 nas células numéricas

In [15]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [16]:
def func(num):
    if isinstance(num, int):
        return num + 1
    elif isinstance(num, str):
        return num + num
    else:
        return num

In [21]:
df=df.map(func)
df

                              col_A  col_B
0  AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA      6
1  BBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBB      7
2  CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC      8
3  DDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD      9

# 10. Aplicar uma função a todas as células do DataFrame

In [159]:
df = pd.DataFrame([[1, 5], [2, 6],
                   [3, 7], [4, 8]], 
                  columns=["col_A", "col_B"])

df

   col_A  col_B
0      1      5
1      2      6
2      3      7
3      4      8

In [160]:
def func(num):
    return num + 1

In [161]:
## inicie o seu código abaixo
#new_df = df.applymap(func)
new_df = df.map(func)
## termine aqui o seu código

In [163]:
new_df

   col_A  col_B
0      2      6
1      3      7
2      4      8
3      5      9